
/**
 * 
 * 5.8企业发放的奖金根据利润提成。利润Ⅰ低于或等于100 000元的,奖金可提10%;利润高于100 000元,低于200 000元(100
 * 000<I≤200 000)时,低于100 000元的部分按10%提成,高于100 000元的部分,可提成7.5%;200 000<I≤400
 * 000时,低于200 000元的部分仍按上述办法提成(下同)。高于200 000元的部分按5%提成;400 000<I≤600 000元时,高于400
 * 000元的部分按3%提成;600 000<I≤1000 000时,高于600 000元的部分按1.5%提成;I>1000 000时,超过100
 * 0000元的部分按1%提成。从键盘输人当月利润Ⅰ,求应发奖金总数。
 * 
 * @author 26465
 *
 */
import java.util.Scanner;

public class Homework5_8 {
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);

		double i; // 利润
		double m = 0;
		System.out.println("请输入你的利润：");
		i = in.nextDouble();

		if (i <= 100000) {
			m = i * 0.1; // 利润提高10%
		} else if (i > 100000 && i <= 200000) {// 100000 < i <= 200000
			m = 100000 * 0.1 + (i - 100000) * 0.075;
		} else if (i > 200000 && i <= 400000) {// 200000 < i <= 400000
			m = 100000 * 0.1 + 100000 * 0.075 + (i - 200000) * 0.05;
		} else if (i > 400000 && i <= 600000) {// 400000 < i <= 600000
			m = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (i - 400000) * 0.03;
		} else if (i > 600000 && i <= 10000000) {// 600000 < i <= 10000000
			m = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (i - 600000) * 0.015;
		} else if (i > 10000000) {
			m = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (i - 10000000) * 0.01;
		}

		System.out.println("利润为" + i + "时，应发奖金数为：" + m);
	}

}
